### 설정변경코드

#### 변수명이 두번 이상 출력되어도 모드 콘솔에서 보여줄 것 

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [3]:
# 모듈 inport
import numpy as np
import pandas as pd

### 행과 열을 동시에 인덱싱 하는 구조는 기본 자료구조 인덱스와 차이가 있음
- df['열']
- df[:'행'] 슬라이싱이 반드시 필요
- df['열'][:'행']

### 데이터 프레임에서 인덱서 사용
#### lic, iloc 속성을 사용하는 인덱싱
#### pandas 패키지는 [행번호][열번호] 인덱싱 불가
- iloc[행번호][열번호] - 가능
- loc[행제목][열제목] - 가능

#### 인덱싱 값
1.인덱스 데이터(index name, column name)

2.인덱스 데이터 슬라이스

3.같은 행 인덱스를 갖는 불리언 시리즈(행 인덱싱인 경우)

4.조건으로 추출 가능

5.위 값을 반환하는 함수

In [4]:
# 예제 df 생성
# 10-21 범위의 숫자를 생성 후 3행 4열로 배치 rp.arange(10,22).reshape(3,4)
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                 index = ['a','b','c'],
                 columns = ["A","B","C","D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [6]:
# loc 인덱서
# 객체.loc[인덱스값]
# 인덱싱 값을 하나만 받는 경우
df.loc['a'] # 행우선 인덱서 이므로 a행의 모든열을 추출하시오
type(df.loc['a'])

A    10
B    11
C    12
D    13
Name: a, dtype: int32

pandas.core.series.Series

In [ ]:
# loc는 행 우선 인덱싱을한다.
# 오류 예제

# df.loc['A']

# A열의 모든 행을 출력하시오. 라는 의미로 전달 했지만
# "A"행의 모든 열을 출력하시오.
# "A"행이 없으므로 key error가 발생

In [7]:
# b행부터 c행의 모든열 반환
df.loc['b':'c']
df['b':'c']
# 동일한 결과 출력

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [9]:
# 인덱서의 인덱스값 : 리스트 사용 가능
# 반환값이 데이터 프레임 형태
df.loc[["b","c"]]
df.loc[["a","c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [10]:
# 두 코드의 반환 결과값의 타입이 다르게 반환 
df.loc['b'] # 시리즈
df.loc[['b']] # df

A    14
B    15
C    16
D    17
Name: b, dtype: int32

    A   B   C   D
b  14  15  16  17

In [12]:
# df[['b','c']] # b와 c를 열이름으로 처리 - 에러발생

In [14]:
# 불리언시리즈 행을 선택하는 인덱싱 값으로 쓸 수 있다.
df.A > 15 # df객체의 A열의 값이 15보다 큰지 확인 T/F로 반환

a    False
b    False
c     True
Name: A, dtype: bool

In [16]:
# 원본출력
df
# A열의 값이 15보다 큰 행을 추출하시오.
df.loc[df.A > 15]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
c  18  19  20  21

In [18]:
# 인덱스 대신 인덱스 값을 반환하는 함수 사용 가능
# 함수작성
def sel_row(df) :
    return df.A > 15

In [20]:
# 함수 호출
sel_row(df)
df.loc[sel_row(df)]

a    False
b    False
c     True
Name: A, dtype: bool

    A   B   C   D
c  18  19  20  21

In [22]:
# 예제 df 생성
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4),
                  columns=['a','b','c','d'])
df2 # 행 인덱스 지정하지 않아서 0부터 1씩 증가되는 정수 인덱스 자동 생성

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [24]:
df2[1:2] # 위치인덱싱 - 2번째 행 출력
df2.loc[1:2] # 값 인덱싱 - 1:2 행 출력

    a   b   c   d
1  14  15  16  17

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [25]:
# 인덱싱의 값으로 행과 열을 모두 받는 경우
# 문법 : df.loc[행인덱스,열인덱스] # 라벨인덱스
# 1행의 a열의 값을 접근해서 출력하시오.
df2.loc[1,'a']

14

In [26]:
# loc를 사용한 원소값 변경
df2.loc[1,'a'] = 50
df2

    a   b   c   d
0  10  11  12  13
1  50  15  16  17
2  18  19  20  21
3  22  23  24  25

In [28]:
df
# loc를 이용한 indexing 예제
# a행의 모든열
df.loc['a'] # 시리즈 형태
df.loc[['a']] # df형태
df.loc['a':] # 시리즈 형태

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

A    10
B    11
C    12
D    13
Name: a, dtype: int32

    A   B   C   D
a  10  11  12  13

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [31]:
df
# df 데이터프레임의 a행의 B,C열을 추출하시오.
df.loc['a','B':'C'] # 시리즈 형태 반환

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

B    11
C    12
Name: a, dtype: int32

In [32]:
# b행부터 모든행의 A열
df.loc['b':,'A']

b    14
c    18
Name: A, dtype: int32

In [40]:
df.loc['a':'b'] # a,b행부터 모든열 df로 반환
df.loc[['a','b']] # a,b행부터 모든열 df로 반환
df.loc[['a','b'],'B'] # a,b행부터 B열 시리즈로 반환
df.loc[['a','b'],['B']] # a,b행부터 B열 df로 반환
df.loc[['a','b'],['B','D']]# a,b행부터 B,D열 df로 반환

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

a    11
b    15
Name: B, dtype: int32

    B
a  11
b  15

    B   D
a  11  13
b  15  17

### iloc 인덱서
- 라벨(name)이 아닌 위치를 나타내는 정수 인덱스만 받는다.
- 위치 정수값음 0부터 시작

In [41]:
df
df.iloc[0, 1] # 0행 1열

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

11

In [43]:
df.iloc[0:2, 1:2] # df 형태로 반환 - 슬리이싱 사용

    B
a  11
b  15

In [44]:
df.iloc[0:2, 1] # 시리즈 형태로 반환

a    11
b    15
Name: B, dtype: int32

In [46]:
df.iloc[0:2, 1:2]

    B
a  11
b  15

In [49]:
# df의 0행의 끝에서 2번째 열부터 끝열까지 반환하시오.
df.iloc[0:1, -2:] #df
df.iloc[0, -2:] #series

    C   D
a  12  13

C    12
D    13
Name: a, dtype: int32

In [ ]:
# iloc[위치, 위치] -> 원소값 반환
# iloc[위치:위치, 위치:위치] -> 원소 반환 : df 반환
# iloc[위치, 위치:위치] -> 원소 반환 : 시리즈 반환
# iloc[위치:위치, 위치] -> 원소 반환 :시리즈 반환

### 연습문제
1. 모든행과 열에 라벨을 가지는 5*5 이상 크기의 데이터 프레임을 만든다. 최다한 간단한 코드로 작성-np의 난수발생 함수 이용)
2. 10가지 이상의 방법으로 특정한 행과 열을 추출해 볼것
- 2번 작업을 진행하면서 주석으로 추출하는 내용을 정리할것

In [74]:
df3 = pd.DataFrame(np.arange(25,50).reshape(5,5),
                  index = ['a','b','c','d','e'],
                   columns=['A','B','C','D','E'])
df3

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [82]:
# 인덱싱 예제
df['A'] # 열 라벨 인덱싱, A열을 추출 - 시리즈
df[0:3] # 0:2 행까지 추출 - 슬라이싱 사용 (행인덱싱) - df
df['A']['a'] # 열행 접근으로 원소값 반환 - 열우선 인덱싱 - 값의 데이터 형으로 반환
df.iloc[1,3:] # 1 행의 3,4열 - 위치값 인덱싱 - 시리즈로 반환
df.loc['a','A':'B'] # 시리즈 반환
df.loc['a':'c','A':'B'] # df반환
df.iloc[-2:,-2:] # df반환
df[:'b']['A']
df[:'b'][['A']]
df.iloc[-2:,:] #df

a    10
b    14
c    18
Name: A, dtype: int32

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

10

D    17
Name: b, dtype: int32

A    10
B    11
Name: a, dtype: int32

    A   B
a  10  11
b  14  15
c  18  19

    C   D
b  16  17
c  20  21

a    10
b    14
Name: A, dtype: int32

    A
a  10
b  14

    A   B   C   D
b  14  15  16  17
c  18  19  20  21